{
  "proposals": [
    {
      "id": "CTO-20260215-001",
      "title": "Add Execution Verification Agent to catch silent failures",
      "category": "new_agent",
      "description": "The daily report reveals 91% execution failure rate was silently reported as 'excellent results' by the CTO system. A new verification agent should cross-check sprint results against actual task execution logs to catch false positives before executive reporting.",
      "implementation_steps": [
        "Create verification agent that compares sprint approval status against actual execution logs",
        "Run verification check before CEO daily report is generated",
        "Flag any discrepancy between reported success and actual execution outcomes",
        "Require manual audit of tasks where verification fails"
      ],
      "approved_date": "2026-02-15",
      "ceo_conditions": [
        "Agent must run BEFORE CEO daily report generation",
        "Must flag ANY discrepancy between reported vs actual execution",
        "Must require manual audit when verification fails",
        "Use Anthropic Claude for reasoning - this is too critical for MiniMax"
      ],
      "priority": "immediate",
      "implementation_status": "pending",
      "verification_notes": ""
    },
    {
      "id": "CTO-20260215-002",
      "title": "Add Redis health check to orchestrator startup",
      "category": "process_change",
      "description": "The learnings document mentions Redis is used for health checks but the health check task (too complex) was rejected 3x. Adding a simple Redis connectivity check at orchestrator startup ensures the execution environment is valid before tasks run, reducing false failures.",
      "implementation_steps": [
        "Add Redis ping to orchestrator init sequence using existing ioredis client",
        "Log connection status at startup; fail fast if Redis unavailable",
        "Add Redis health to /health endpoint"
      ],
      "approved_date": "2026-02-15",
      "ceo_conditions": [
        "Keep it simple - just Redis ping, not complex health monitoring",
        "Fail fast at startup if Redis unavailable",
        "Log connection status for debugging"
      ],
      "priority": "next_sprint",
      "implementation_status": "pending",
      "verification_notes": ""
    },
    {
      "id": "CTO-20260216-001",
      "title": "Add Sprint-Retrospective Agent to Capture Learnings",
      "category": "new_agent",
      "description": "The learnings.md file contains critical insights about MiniMax token limits (4500 max), task decomposition rules, and rejection patterns. However, these learnings aren't systematically applied to new tasks. The daily report shows 3 rejections (SDK-060, BE-110, BE-111) and stalled execution, suggesting the same issues may repeat. A dedicated agent to capture and apply sprint learnings would improve task success rates.",
      "implementation_steps": [
        "Create agent directory: agents/sprint-retrospective/",
        "Implement agent to read previous sprint results and learnings before new task creation",
        "Add pattern matching: if task type matches previously failed types, inject decomposition rules into prompt",
        "Run every_sprint to analyze rejected tasks and update learnings.md with new patterns",
        "Test by comparing SDK-060 failure pattern against new task prompts"
      ],
      "approved_date": "2026-02-15",
      "ceo_conditions": [
        "Agent must read both learnings.md AND previous sprint results before each run",
        "Pattern matching must be specific - inject concrete rules, not generic advice",
        "Must update learnings.md with new patterns discovered from rejected tasks"
      ],
      "priority": "next_sprint",
      "implementation_status": "superseded",
      "verification_notes": "Superseded by autonomous CTO post-sprint-analysis built into orchestrator Phase 5b (2026-02-15)"
    },
    {
      "id": "CTO-20260217-003",
      "title": "Debug Backend-Core Execution Blocker",
      "category": "tooling",
      "description": "Daily report indicates backend-core agent not executing pending tasks (SDK-061, SDK-062) despite 100% Week-9 success rate. This is a critical infrastructure issue - tasks planned but not executed. Need immediate diagnostic to identify root cause.",
      "implementation_steps": [
        "1. Check orchestrator logs for backend-core agent errors or hangs",
        "2. Verify agent dynamic loading is working (agents/backend-core/)",
        "3. Check if PM2 process for backend-core is running",
        "4. Test agent invocation manually with a simple task",
        "5. Verify no changes to orchestrator config broke agent execution",
        "6. Report findings and fix to CEO"
      ],
      "approved_date": "2026-02-15",
      "ceo_conditions": [
        "Report findings within 2 hours",
        "If fix requires code changes, get Supervisor review"
      ],
      "priority": "immediate",
      "implementation_status": "pending",
      "verification_notes": ""
    },
    {
      "id": "CTO-20260217-001",
      "title": "Implement Sprint-Retrospective Agent",
      "category": "new_agent",
      "description": "CEO approved sprint-retrospective agent in previous cycle to prevent recurring rejection patterns. This agent should analyze sprint results, identify failure patterns, and recommend task decomposition or process changes before next sprint. The critical execution blocker in current sprint demonstrates why systematic retrospective is needed.",
      "implementation_steps": [
        "1. Use Skills Agent to create sprint-retrospective agent with MiniMax LLM",
        "2. Configure trigger: every_sprint (runs after sprint results are available)",
        "3. Agent reads: sprint results, rejection patterns, learnings.md, previous retrospectives",
        "4. Agent outputs: pattern analysis, decomposition recommendations, process improvement suggestions",
        "5. Store outputs in reports/sprint-retrospective/ for CEO review"
      ],
      "approved_date": "2026-02-15",
      "ceo_conditions": [
        "Agent must read all sprint data before analysis",
        "Output format must be structured for CEO review"
      ],
      "priority": "next_sprint",
      "implementation_status": "superseded",
      "verification_notes": "Superseded by autonomous CTO post-sprint-analysis built into orchestrator Phase 5b (2026-02-15)"
    },
    {
      "id": "CTO-20260217-002",
      "title": "Enhance Execution-Verifier to Monitor Agent Health",
      "category": "process_change",
      "description": "The execution-verifier agent exists but failed to detect the critical backend-core execution blocker. Current implementation verifies task execution but doesn't monitor agent health or detect when approved tasks aren't being processed. Need to add proactive health checks.",
      "implementation_steps": [
        "1. Review current execution-verifier implementation in agents/execution-verifier/",
        "2. Add agent health check: verify all scheduled agents processed their task queues",
        "3. Add pending task alert: if tasks remain pending >1 hour, trigger alert",
        "4. Add execution failure pattern detection: flag agents with >2 consecutive empty sprints",
        "5. Update orchestrator to emit agent heartbeat events for monitoring"
      ],
      "approved_date": "2026-02-15",
      "ceo_conditions": [
        "Must include rollback plan for health check changes",
        "Alert thresholds must be configurable"
      ],
      "priority": "next_sprint",
      "implementation_status": "pending",
      "verification_notes": ""
    },
    {
      "id": "CTO-20260215-003",
      "title": "Verify OpenClaw v2026.2.12 for Pipeline Fixes",
      "category": "tooling",
      "description": "Check OpenClaw GitHub for releases since v2026.2.12 that may address orchestrator execution issues or provide better error handling for pipeline failures.",
      "implementation_steps": [
        "Check https://github.com/openclaw/openclaw/releases for versions > v2026.2.12",
        "Review changelog for orchestrator fixes, error handling improvements, or execution monitoring",
        "If newer version available: test in staging before production upgrade",
        "Note: OpenClaw may have community fixes for the exact pipeline failure we're experiencing"
      ],
      "approved_date": "2026-02-15",
      "ceo_conditions": [
        "Check releases first - if newer version exists, review changelog for execution fixes",
        "Test any upgrades in staging environment only",
        "Document findings even if no relevant updates found"
      ],
      "priority": "immediate",
      "implementation_status": "pending",
      "verification_notes": ""
    },
    {
      "id": "CTO-20260216-003",
      "title": "Add response caching for repeated LLM calls",
      "category": "cost_optimization",
      "description": "Review learnings mention caching opportunities. Implement caching layer for identical LLM calls (e.g., system prompts, common validation logic) to reduce redundant API calls.",
      "implementation_steps": [
        "Audit recent sprint logs for repeated identical prompts",
        "Implement Redis-backed prompt cache with TTL",
        "Add cache hit/miss metrics to monitoring",
        "Test cache effectiveness over 1-2 sprints"
      ],
      "approved_date": "2026-02-15",
      "ceo_conditions": [
        "Implement cache invalidation strategy",
        "Add monitoring for cache hit rates",
        "Start with 1-hour TTL for safety"
      ],
      "priority": "next_sprint",
      "implementation_status": "pending",
      "verification_notes": ""
    },
    {
      "id": "CTO-20260215-004",
      "title": "Add post-write file integrity check to orchestrator",
      "category": "process_change",
      "description": "MiniMax destructive rewrites destroyed router.ts (lost all routes) and api-client.ts (replaced 170-line file with 15-line stub) in Week 18. Add a pre-commit integrity check: after MiniMax writes a file, compare line count with the original. If new file is <50% the size of the original AND the task was fix/add, flag for manual review.",
      "implementation_steps": [
        "In orchestrator executeTask(), save original file line count before MiniMax writes",
        "After write, compare new line count. If new < 50% of original AND task type is fix/add, reject automatically",
        "Log warning: File shrank from N to M lines — possible destructive rewrite",
        "Add to supervisor prompt: Check if the file lost existing functionality"
      ],
      "approved_date": "2026-02-15",
      "ceo_conditions": [
        "Only apply to task types 'fix' and 'add' — full 'feature' rewrites are expected to change file size",
        "Log the warning but also show the original vs new line count in supervisor review context",
        "Threshold should be configurable (start at 50%, can adjust based on data)"
      ],
      "priority": "immediate",
      "implementation_status": "verified",
      "verification_notes": "IMPLEMENTED 2026-02-15. Added to orchestrate-agents-v2.ts CodingAgent.execute(): (1) Pre-write integrity check comparing original vs new line count, (2) 50% threshold (configurable INTEGRITY_THRESHOLD), (3) Applies to bugfix tasks + all existing files >10 lines, (4) Logs warning with line counts, (5) Preserves original file on failure, (6) Passes integrity alert to supervisor prompts"
    },
    {
      "id": "CTO-20260215-005",
      "title": "Upgrade code fence stripping to handle all MiniMax variants",
      "category": "tooling",
      "description": "Code fence contamination persists despite Week 11 fix. FE-100, FE-101, and FE-102 all had code fences in Week 18. FE-102 was even auto-approved WITH fences (supervisor false negative). Need comprehensive post-processing.",
      "implementation_steps": [
        "In orchestrator, after receiving MiniMax output: apply aggressive fence strip regex",
        "Pattern: remove any line matching /^\\s*```\\w*\\s*$/ at start and end of output",
        "Also strip <think>...</think> tags and any markdown headers before first code line",
        "Add fence detection to supervisor checklist: if output contains ``` anywhere, auto-reject",
        "Test against FE-100, FE-101, FE-102 outputs from Week 18"
      ],
      "approved_date": "2026-02-15",
      "ceo_conditions": [
        "Fence stripping must happen BEFORE file is written to disk, not after",
        "Add a simple automated test: if any line in output matches /^\\s*```/, strip it",
        "Supervisor prompt must explicitly check: Does the file start with a markdown code fence?"
      ],
      "priority": "immediate",
      "implementation_status": "verified",
      "verification_notes": "IMPLEMENTED 2026-02-15. Added to orchestrate-agents-v2.ts: (1) Enhanced extractCodeBlocks() with broader regex for all fence variants, (2) New stripResidualFences() method removes ALL fence markers + markdown headers before code, (3) Applied BEFORE file write to disk (CEO condition met), (4) Residual fence detection warning logged, (5) Both supervisor prompts (Claude+Codex) now explicitly check for code fences and auto-reject"
    },
    {
      "id": "CTO-20260215-006",
      "title": "Split large frontend files into composable components before task assignment",
      "category": "architecture",
      "description": "Frontend files >65 lines consistently fail (sidebar 105 lines, api-keys 227 lines). MiniMax 4500-token output limit is a hard ceiling. Pre-split large components into smaller files (<60 lines each) and assign tasks to individual files.",
      "implementation_steps": [
        "Before sprint creation: scan target files for line count",
        "If file >65 lines: split into composable sub-components",
        "Task description should target the specific sub-component file, not the parent",
        "Add to task creation rules: Frontend tasks must target files <65 lines",
        "Apply to Week 19: pre-split sidebar.tsx and api-keys/page.tsx before assigning tasks"
      ],
      "approved_date": "2026-02-15",
      "ceo_conditions": [
        "Start with sidebar.tsx only — it has failed 2 consecutive sprints, so it's the best test case",
        "Do NOT auto-split files — CTO/CEO should review the split plan before each sprint",
        "Add line count check to sprint design phase: warn if any task targets a file >65 lines",
        "Track success rate before/after split to validate the approach"
      ],
      "priority": "next_sprint",
      "implementation_status": "in_progress",
      "verification_notes": "STARTED 2026-02-15. sidebar.tsx split: 114 lines → sidebar.tsx (53 lines) + sidebar-nav-items.ts (75 lines data). Week 19 sprint tasks all target files <65 lines. api-keys/page.tsx split deferred — no api-keys tasks in Week 19."
    }
  ],
  "last_updated": "2026-02-15"
}